/*
 Localizable.strings
 Owncloud iOs Client
 
 Created by Javier Gonzalez on 7/17/12.
 */

/*
 Copyright (C) 2016, ownCloud GmbH.
 This code is covered by the GNU Public License Version 3.
 For distribution utilizing Apple mechanisms please see https://owncloud.org/contribute/iOS-license-exception/
 You should have received a copy of this license
 along with this program. If not, see <http://www.gnu.org/licenses/gpl-3.0.en.html>.
 */


//First Screen
"go_to_login" = "Configurar Conta";
"you_need_an_account" = "Não existem contas $appname no seu dispositivo.\nPara poder utilizar esta App, precisa de criar uma.";

//Login Screen
"testing_connection" = "Teste de Ligação";
"server_instance_not_found" = "Servidor não encontrado";
"secure_connection_established" = "Ligação Segura";
"https_non_secure_connection_established" = "Redirecionado para uma rota insegura";
"connection_established" = "Sem Ligação Segura";
"login_details" = "Detalhes da Sessão";
"username" = "Nome de utilizador";
"password" = "Palavra-passe";
"login" = "Ligar";
"cancel" = "Cancelar";
"error_login_message" = "O utilizador ou a palavra-passe está incorreto";
"error_updating_predefined_url" = "O servidor foi movido para um URL diferente. Por favor, autentique outra vez para atualizar a sua conta";
"ok" = "ACEITAR";
"url_sample" = "Endereço do servidor https://…";
"forbidden_characters_in_password" = "Esta palavra-passe contém carateres proibidos.";
"server" = "Servidor";
"url" = "URL";
"session_expired" = "A sua sessão expirou. Por favor, inicie a sessão novamente";
"credentials_different_user" = "O utilizador inserido não coincide com o utilizador desta conta";
"auth_unsupported_auth_method" = "O servidor não suporta este método de autenticação";
"server_does_not_give_user_id" = "O servidor não está a devolver a Id. do utilizador correta. Por favor, contacte o seu administrador";
"authentification_not_valid" = "Não é possível autenticar para este servidor";
"error_too_many_http_redirects" = "Ocorreu um erro ao estabelecer a ligação. Por favor, tente novamente";
"retry" = "Repetir";
"help_link_login" = "Novo para $appname?";
"error_could_not_add_account" = "Não foi possível guardar a informação do utilizador. Por favor, tente novamente.";
"account_not_new" = "Já existe uma conta para este utilizador e servidor no dispositivo";
"oauth2_error_access_denied" = "Acesso negado pelo servidor de autorização";
"oauth2_error" = "Autorização mal sucedida";

//TabBarItems
"settings"="Definições";
"files_tab"="Ficheiros";

//Uploading
"upload" = "Enviar";
"account" = "Conta:";
"location" = "Localização:";
"photo_albums" = "Álbuns de Fotografias";
"loading" = "A carregar...";
"no_access_to_gallery" = "Por favor, ative o acesso às Fotografias e Vídeos para $appname. Esta opção pode ser encontrada em Definições > Privacidade > Fotografias.";
"error" = "Erro";
"upload_failed"="Envio Falhou";
"redirection_problem"="A ação de redirecionamento do URL não é suportada";
"all_photos" = "Todas as Fotografias";

//First View
"menu_upload" = "Enviar Fotografia/Vídeo";
"menu_folder" = "Nova Pasta";
"menu_text_file" = "Novo ficheiro de texto";
"sort_menu_title" = "Ordenar";
"sort_menu_by_name_option" = "A-Z";
"sort_menu_by_modification_date_option" = "Recentes-Antigos";
"sort_menu_by_kind_option" = "Tipo";

//Create/Edit File Text
"create_text_file" = "Criar Novo Ficheiro de Texto";
"title_view_new_text_file" = "Novo Ficheiro de Texto";
"title_view_edit_text_file" = "Editar Ficheiro de Texto";
"default_text_file_title" = "Novo ficheiro de texto";
"title_text_file_placeholder" = "Titulo...";
"body_text_file_placeholder" = "...";
"error_text_file_exist" = "já existe";
"error_file_name_empty" = "O nome de ficheiro não pode estar em branco.";
"no_changes_made" = "Não foram efetuadas alterações";
"no_file_downloaded" = "O ficheiro não foi transferido, não o pode editar";


//Create Folder
"create_folder" = "Criar Nova Pasta";
"folder_name" = "Inserir Nome da Pasta";
"save" = "Guardar";
"folder_exist" = "Já existe uma pasta com esse nome. Por favor, insira outro nome.";
"folder_create_error"="Não foi possível criar a diretoria";
"not_show_potrait"="O menu não está disponível na visualização em paisagem. Por favor, altere a visualização para retrato.";
"not_possible_create_folder" = "Não foi possível criar a pasta.";

//FilesView
"confirm_to_delete_item" = "Confirmar Eliminação do Item";
"yes" = "Sim";
"no" = "Não";
"delete_from_device" = "Tem a certeza que deseja eliminar este ficheiro deste dispositivo?";
"delete_from_server" = "Tem a certeza que deseja eliminar este ficheiro do servidor?";
"not_possible_connect_to_server" = "De momento, não é possível ligar ao servidor.";
"delete_folder_from_server" = "Tem a certeza que deseja eliminar esta pasta do servidor?";
"delete_local_server" = "Eliminar do dispositivo e do servidor";
"delete_local" = "Eliminar do dispositivo";
"delete_server" = "Eliminar do servidor";
"error_path" = "Não encontrado. Por favor, certifique-se que existe";
"error_not_permission" = "Não tem permissão para completar esta operação";
"folders" = "pastas";
"files" = "ficheiros";
"folder" = "pasta";
"file" = "ficheiro";
"more_swipe" = "Mais";
"message_not_files" = "Aqui não existe nada. Envie qualquer coisa!";
"maintenance_mode_on_server_message" = "De momento, não é possível ligar ao servidor. O servidor encontra-se no modo de manutenção.";

//Refresh file list
"release_refresh"="Solte para atualizar...";
"loading_refresh"="A carregar...";
"pull_down_refresh"="Puxe para baixo para atualizar.";

//Miscelanea
"back" = "Voltar";

//Preview
"open_with_label" = "Abrir com";
"delete_label"= "Eliminar ";

//Open with
"file_cannot_be_opened" = "Não é possível abrir o ficheiro";
"no_app_instaled_to_open_it" = "Não tem nenhuma aplicação instalada para abrir este tipo de ficheiro.";

//WTClient messages (Download/Upload)
"establishing_connection" = "A estabelecer a ligação";
"not_establishing_connection" = "Não É Possível Estabelecer Ligação";
"connection_closed" = "Ligação fechada";
"connection_lost" = "Ligação perdida";
"auth_failed" = "A autenticação falhou";
"auth_passed" = "Autenticação Aprovada";
"request_file_not_found" = "Ficheiro solicitado não encontrado no servidor";
"request_file_not_accesed" = "Ficheiro solicitado não pode ser acedido";
"unknow_response_server" = "Erro. Resposta inesperada do servidor.";
"uploading_data" = "Envio de Dados";
"downloading_data" = "Transferência de Dados";
"transfer_complete" = "Transferência concluída ";
"transfer_failed" = "Transferência falhou";
"download_file" = "Transferir ficheiro";

//Settings and PinCode
"title_app_pin" = "Código de Proteção";
"title_app_pin_and_touchID" = "Proteção por Código e Id. por Toque";
"title_app_pin_and_faceID" = "Proteção por Código e Id. de Toque";
"title_app_pin_forced" = "Alterar Código de Proteção";
"enter_app_pin" = "Inserir Código";
"enter_app_pin_long_description_forced" = "Código de proteção necessário. Precisa de definir um código de proteção para iniciar a sessão.";
"enter_app_pin_long_description" = "Inserir Código";
"reenter_app_pin" = "Reinserir Código";
"remove_app_pin" = "Remover Código";
"both_pass_not_same" = "Os Códigos inseridos não coincidem";
"app_pin_incorrect" = "Código incorreto";
"passcode_not_enabled" = "Ativar código primeiro";
"title_app_touchID" = "Id. por Toque";
"title_app_faceID" = "Id. de Rosto";
"disconnect_button" = "Desligar deste servidor";
"pin_removed" = "Código removido";
"incorrect_pin" = "Código Incorreto";
"app_pin_stored" = "Código guardado";
"help" = "Ajuda";
"recommend_to_friend" = "Recomendar a Amigo";
"send_feedback" = "Enviar Opinião";
"manage_accounts" = "Gerir Contas";
"add_new_account" = "Adicionar nova conta";
"save_changes" = "Guardar";
"add_account" = "Adicionar";
"user_exist" = "O utilizador inserido já existe";
"imprint_button" = "Marca";
"title_instant_upload_photos"="Envio de Fotografias Instantâneo";
"title_instant_upload_videos"="Envio de Vídeos Instantâneo";
"title_background_instant_upload" = "Envio Instantâneo em Segundo plano";
"accounts_section" = "Contas";
"security_section" = "Segurança";
"instant_updloads_section" = "Envios Instantâneos";
"more_section" = "Mais";
"unlock_app" = "Desbloquear $appname";
"passcode_forced_can_not_be_disabled" = "Código de proteção forçado. Não pode ser desativado.";
"pending_migration_to_new_url" = "Insira para migrar para um novo URL";

//Downloading
"can_no_copy_to_gallery" = "Este ficheiro não pode ser copiado para a galeria porque não pode ser aberto pela mesma";
"file_is_downloading" = "Este ficheiro já está a ser transferido";
"download_file_exist" = "Não é possível abrir este ficheiro. Por favor, verifique se este existe";
"wait_to_download" = "A preparar para transferir";
"updating" = "A atualizar";
"msg_while_downloads" = "Não é possível concluir esta operação. Por favor, aguarde até que a transferência atual termine";
"streaming_no_possible_ssl_self_signed" = "A transmissão não pode ser iniciada porque o seu certificado de servidor não é de confiança. A transferência do ficheiro começará automaticamente";

//SSL
"invalid_ssl_cert" = "A identidade do sítio não pode ser verificada. Mesmo assim, quer confiar neste certificado?";
"connection_declined" = "Ligação recusada pelo utilizador";
"server_certificate_untrusted" = "O certificado do servidor não é de confiança";

//Recent view
"recent_now"="Segundos atrás";
"recent_minutes"="$minutes minutos atrás";
"recent_minute"="$minutes minuto atrás";
"recent_hours"="$hours horas atrás";
"recent_hour"="$hours hora atrás";
"recent_days"="$days dias atrás";
"recent_day"="$days dia atrás";
"recent_months"="$months meses atrás";
"recent_month"="$months mês atrás";

"uploads_tab"="Envios";
"current_section"="Atualmente";
"uploader_section"="Enviado";
"nothing_was_upload_recently"="Recentemente não foi enviado nada deste dispositivo";
"failed_uploader_section"="Envios Falhados";
"clear_successful"="Limpeza bem sucedida";
"error_credential"="Erro de credenciais";
"error_destiny_does_not_exist"="Erro de pasta";
"error_file_exists"="Erro de conflito";
"error_permission" = "Erro de permissão";
"error_not_allowed_by_firewall_rule" = "Envio não autorizado";
"error_file_does_not_exist" = "Não disponível no dispositivo";
"error_file_in_background" = "Erro de servidor";
"error_insufficient_storage" = "Não existe espaço suficiente na conta";
"error_file_invalid_characters" = "Carateres inválidos";
"change_active_user"="Alterar o utilizador ativo para";
"waiting_for_server"="A aguardar pela ligação do servidor";
"waiting_for_upload"="A aguardar para enviar";
"error_permission_alert_message" = "Não tem permissão para enviar para esta pasta";
"choose_folder" = "Escolha pasta";

//Select Folder View
"upload_label"="Enviar para";
"create_button"="Criar";
"choose_button"="Escolher";

//Rename
"rename_long_press" = "Renomear";
"rename_file_title" = "Renomear";
"enter_new_name" = "Insira um novo nome:";
"rename_file_exist" = "Já existe um ficheiro com esse nome. Por favor, insira outro nome.";

//Move
"move_long_press" = "Mover";
"move_to_label" = "Mover para";
"file_exist" = "O ficheiro já existe na pasta de destino";
"override_file" = "Deseja substituir o ficheiro existente com este?";
"accept" = "Aceitar";
"error_folder_destiny_is_the_same" = "ERRO: não é possível mover a pasta para ela própria";
"original_file_exist" = "Não é possível mover este ficheiro. Por favor, verifique se este existe";
"original_folder_exist" = "Não é possível mover esta pasta. Por favor, verifique se esta existe";

//Download folfer
"download_folder" = "Transferir Pasta";
"cancel_download" = "Cancelar Transferência";

//Upload from other apps
"other_apps_title" = "Destino";
"other_apps_account" = "Conta";
"other_apps_folder" = "Pasta";
"other_apps_file_name" = "Nome do ficheiro";
"other_apps_send_to" = "Enviar para";
"error_moving_file" = "Não é possível mover este ficheiro. Verifique se a pasta de destino existe";
"forbidden_characters_from_server" = "O nome contém pelo menos um caráter inválido";
"overwritte_title" = "Substituir";

//Social
"twitter_message" = "Teste $twitteruser no seu \"smartphone\"!";
"facebook_message" = "Teste $appname no seu \"smartphone\"!\n";
"mail_recommendation_subject" = "Teste $appname no seu \"smartphone\"!";
"mail_recommendation_body" = "Eu quero convidá-lo para usar $appname no seu telemóvel!\nTransfira aqui:";
"device_not_support_mail" = "Por favor, configure a sua conta de correio eletrónico";
"mail_feedback_subject" = "$appname - Comentário/Opinião";
"account_not_configure" = "O seu dispositivo não tem a conta configurada. Vá a Definições para a configurar.";

//Storage
"of_storage" = "de";
"occupied_storage" = "ocupado";
"storage" = "Armazenamento";
"storage_upgrade" = "Atualizar Armazenamento";

//Jimmies
"this_file_is_older" = "Disponível versão mais recente";
"msg_update_file_0_bytes" = "O ficheiro no servidor tem 0 bytes. Quer substituir o ficheiro existente no seu dispositivo com este ficheiro vazio?";

//Shared
"shared_tab" = "Hiperligações públicas";
"message_not_shared_files" = "Ainda não partilhou quaisquer ficheiros por hiperligação.";
"message_not_shared_api_support" = "Desculpe, a partilha não está ativada no servidor. Por favor, contacte o seu administrador";
"share_link_long_press" = "Partilhar";
"unshare_link" = "Remover partilha de hiperligação";
"share_not_available_on_this_server" = "Desculpe, esta funcionalidade não está ativada no servidor. Por favor, contacte o administrador";
"copy_link" = "Copiar hiperligação";
"file_to_share_not_exist" = "Não é possível partilhar este ficheiro ou pasta. Por favor, verifique se este(a) existe";
"file_to_unshare_not_exist" = "Não é possível remover a partilha deste ficheiro ou pasta. Por favor, verifique se este(a) existe";
"shared_link_protected_title" = "Insira uma palavra-passe";
"shared_link_protected_message" = "Para partilhar a hiperligação deve inserir uma palavra-passe para a proteger.";
"pasword_empty" = "A palavra-passe não pode estar em branco";
"no_pasword" = "Deve inserir uma palavra-passe";
"get_share_link" = "Obter Hiperligação Pública";
"title_share_link_option_name" = "Nome de Hiperligação";
"title_share_link_option_password" = "Palavra-passe";
"title_share_link_option_expiration" = "Expiração";
"title_share_link_option_allow_dowload_view" = "Transferir / Ver\n";
"title_share_link_option_allow_dowload_view_upload" = "Download / View / Upload";
"title_share_link_option_allow_upload_only" = "Upload only (File Drop)";
"placeholder_share_link_option_name" = "Nome";
"placeholder_share_link_option_password" = "Escolha uma palavra-passe";
"placeholder_share_link_option_expiration" = "Data de expiração";
"title_view_create_link" = "Criar partilha de hiperligação";
"title_view_edit_link" = "Editar partilha de hiperligação";
"title_confirm_delete_link" = "Remover hiperligação";
"message_confirm_delete_link" = "! Eliminar $sharedLink";
"default_link_name" = "Hiperligação de $fileName";
"allow_editing" = "Permitir edição";
"show_error_password_enforced" = "Obrigatório palavra-passe";
"show_error_expiration_enforced" = "A hiperligação pública expira, o mais tardar em $nDays dias depois de esta ser criada";
"default_not_possible_msg" = "Não é possível realizar esta operação, por favor, tente mais tarde";
"share_user_group_indicator" = "grupo";
"share_user_federated_indicator" = "remoto";
"add_user_or_group_title" = "Adicionar Utilizador ou Grupo";
"share_with_users_or_groups" = "Utilizadores e Grupos";
"not_share_with_users_yet"= "Ainda não partilhado com qualquer utilizador";
"not_share_by_link_yet"= "Ainda não foi partilhado via hiperligação pública";
"not_sharee_api_supported" = "Desculpe, a versão do seu servidor não permite a partilha com utilizadores. Por favor, contacte o seu administrador";
"share_link_title" = "Hiperligações Públicas";
"warning_sharing_public_link" = "Qualquer pessoa com a hiperligação tem acesso ao ficheiro/pasta";
"not_share_link_enabled_capabilities" = "A hiperligação de partilha não está ativada neste servidor. Por favor, contacte o seu administrador";
"shared_link_cannot_remove_password" = "Não é possível remover a palavra-passe";
"shared_link_cannot_remove_expiration_date" = "Não é possível limpar a data de expiração. As partilhas devem ter uma data de expiração";
"shared_link_mail_subject" = "$userName partilhou »$fileOrFolderName« consigo";
"secured_link" = "Protegido";
"message_private_link" = "Hiperligação privada: apenas as pessoas que têm acesso ao ficheiro / pasta podem usá-la. Use-a como uma ligação permanente para si mesmo ou para apontar outros para os ficheiros dentro das partilhas";

//Shared privileges
"title_user_can_edit" = "Pode editar";
"title_user_can_share" = "Pode partilhar";
"user_can_create" = "criar";
"user_can_change" = "alterar";
"user_can_delete" = "eliminar";
"title_view_edit_user_privileges" = "Privilégios";

//Shared Link Options
"title_view_share_link_options" = "Opções de Hiperligação";

//Favorites
"favorite" = "Favorito";
"unfavorite" = "Remover Favorito";
"parent_folder_is_favorite" = "Uma pasta que contém este ficheiro já está nos favoritos";

//Available offline
"available_offline" = "Disponível off-line";
"not_available_offline" = "Não disponível off-line";
"parent_folder_is_available_offline_file_child" = "Uma pasta que contém este ficheiro já está disponível off-line";
"parent_folder_is_available_offline_folder_child" = "Uma pasta que contém esta pasta já está disponível off-line";

//Document provider
"error_login_doc_provider" = "Não é possível aceder à sua conta. Primeiro, use por favor, a app $appname para iniciar a sessão.";
"error_sending_file_to_document_picker" = "Erro ao enviar o ficheiro para separador de documentos";
"error_user_change_in_core_app" = "O utilizador foi alterado na app $appname";
"error_connecting_with_server" = "Não tem sido possível ligar ao servidor, por favor, tente mais tarde";
"move_doc_provider_button" = "Mover para esta localização";
"export_doc_provider_button" = "Exportar para esta localização";

//Instant uploads
"location_not_enabled"="Serviços de Localização desativados";
"message_location_not_enabled"="Por favor vá a Definições e ligue os Serviços de Localização para ativar envios instantâneos em segundo plano.";

"access_photos_library_not_enabled" = "Acesso às Fotografias não ativado";
"message_access_photos_not_enabled" = "Por favor, vá a 'Definições' e ative o 'Acesso às Fotografias' para permitir os envios instantâneos das fotografias.";

//PDF reader
"page_of_pages" = "de"; //Example: 5 of 10

//Share in
"files_added" = "Ficheiros adicionados";
"files_will_be_upload_next_time" = "Os ficheiros começarão a ser enviados na próxima vez que abrir $appname";

//Help Guide main app
"title_help_slide_0" = "Bem-vindo a $appname!";
"message_help_slide_0" = "Deslize para saber mais";
"title_help_slide_1" = "Envios Instantâneos";
"message_help_slide_1" = "Mantenha as suas fotografias seguras";
"title_help_slide_2" = "Controle todos os seus ficheiros";
"message_help_slide_2" = "Pode eliminar, mover";
"title_help_slide_3" = "Partilhar";
"message_help_slide_3" = "Pode partilhar ficheiros e pastas";
"title_help_slide_4" = "Conta Múltipla";
"message_help_slide_4" = "Ligar a todas as suas nuvens";
"title_help_slide_5" = "Os seus ficheiros privados sincronizados em qualquer lugar";
"message_help_slide_5" = "5";
"sign_in_button_help_guide" = "Iniciar sessão";
"skip_button_help_guide" = "Ignorar";

//Update Guide main app
"title_update_slide_0" = "Discover the new ownCloud App";
"message_update_slide_0" = "Rebuilt from scratch for iOS 11+";
"title_update_slide_1" = "PDF Viewer";
"message_update_slide_1" = "Easy Search and Navigation";
"title_update_slide_2" = "File Management";
"message_update_slide_2" = "Share Files and Folders";
"title_update_slide_3" = "Quick Access";
"message_update_slide_3" = "Complete Data Overview";
"title_update_slide_4" = "Multiple Accounts";
"message_update_slide_4" = "Access to all your clouds";
"title_update_slide_5" = "Get it for free on the AppStore";
"message_update_slide_5" = "Secure Data Management";
"sign_in_button_update_guide" = "Transferir";
"skip_button_update_guide" = "Transferir";

//Account menu
"menu_account_edit" = "Editar Palavra-passe";
"menu_account_clear_cache" = "Limpar cache";
"menu_account_log_out" = "Remover conta";

//Common
"not_connected_to_internet" = "O dispositivo não está ligado a uma rede";
"bad_request" = "Pedido Inválido";
"method_not_allowed" = "Método não autorizado";
"proxy_auth_required" = "Obrigatório autenticação de proxy";
"conflict" = "Conflito";
"internal_error" = "Erro interno do servidor";
"not_implemented" = "Não implementado";
"bad_gateway" = "Acesso inválido";

//Private links
"private_link_redirection_failed" = "O item não existe";
"error_connecting_with_server" = "Não tem sido possível ligar ao servidor, por favor, tente mais tarde";
"private_link_not_reachable" = "Não foi possível abrir a hiperligação privada";
